/*Есть List<String>. Все элементы в нем должны быть строки-целые числа вида “231”,
но некоторые данные повреждены (например, содержат символы).
Необходимо преобразовать данный список в List<Integer>. При этом вывести на экран детализированный список
«ошибок» т.е. в каких ячейках и какие значения не были преобразованы.
Подсказка: необходимо использовать метод Integer.parseInt и обрабатывать его эксэпшены. */
public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
